export const TOAST_MESSAGE = {
  "회원가입을 하였습니다.": "회원가입을 하였습니다.",
  "회원가입에 실패하였습니다.": "회원가입에 실패하였습니다.",
  "이메일 인증이 필요합니다.": "이메일 인증이 필요합니다.",
};

export const VALIDATION_MESSAGE = {
  "이메일 형식이 잘못되었습니다.": "이메일 형식이 잘못되었습니다.",
  "인증코드가 잘못되었습니다.": "인증코드가 잘못되었습니다.",
  "8자이상": "8자이상",
  "영대문자, 영소문자, 특수문자 포함": "영대문자, 영소문자, 특수문자 포함",
  "약관에 모두 동의하여야 가입 가능합니다.":
    "약관에 모두 동의하여야 가입 가능합니다.",
  "인증되었습니다.": "인증되었습니다.",
  "필수 필드입니다.": "필수 필드입니다.",
} as const;

export const PLACEHOLDER = {
  "이메일을 입력해주세요.": "이메일을 입력해주세요.",
  이메일: "이메일",
  "이메일 인증코드": "이메일 인증코드",
  "비밀번호를 입력해주세요.": "비밀번호를 입력해주세요.",
  비밀번호: "비밀번호",
} as const;
